org/ntp.org
#+TITLE: Napredne tehnike programiranja
#+LANGUAGE: sr
#+SETUPFILE: /media/novak/Storage/Emacs/org-html-themes/setup/theme-bigblow.setup

* Pregled upotrebljivosti

  |                                      |                              | Clojure                                                           | Haskell                                                  | Go                                 |
  |--------------------------------------+------------------------------+-------------------------------------------------------------------+----------------------------------------------------------+------------------------------------|
  | editori                              | Atom                         | da (nema debugger), [[https://atom.io/packages/proto-repl][proto-repl]]                                    | [[https://atom.io/packages/ide-haskell][ide-haskell]] ([[https://github.com/simonmichael/haskell-atom-setup][setup manual]])                               | [[https://atom.io/packages/go-plus][go-plus]] (video sam da se koristi)  |
  |                                      | [[https://github.com/LightTable/LightTable][LightTable]]                   | pisan u Clojure (nema debugger)                                   | [[https://github.com/jetaggart/light-haskell][light-haskell]] (slaba podrška)                            | [[https://github.com/toqueteos/LightTable-Go][Light-Table-Go]] (slaba podrška)     |
  |                                      | [[https://github.com/oakes/Nightcode][NightCode]]                    | pisan u Clojure, simple (nema debugger) - preporuka [[http://www.clojurebridge.org/][ClojureBridge]] | ne                                                       | ne                                 |
  |                                      | [[http://leksah.org/][Leksah]]                       | ne                                                                | pisan u Haskell                                          | ne                                 |
  |                                      | Eclipse                      | [[http://doc.ccw-ide.org/documentation.html#_debug_clojure_code][CCW]] (ima integrisan debugger)                                     | [[http://eclipsefp.github.io/][Eclipse FP]]                                               | [[https://github.com/GoClipse/goclipse][GoClipse]]                           |
  |                                      | Visual Studio Code           | [[https://marketplace.visualstudio.com/items?itemName=avli.clojure][clojureVSCode]] (nema debugger)                                     | [[https://marketplace.visualstudio.com/items?itemName=justusadam.language-haskell][Syntax HL]] ([[https://visualstudio.uservoice.com/forums/293070-visual-studio-code/suggestions/7756542-haskell][slabo]])                                        | [[https://github.com/Microsoft/vscode-go][vscode-go]]                          |
  |                                      | Emacs                        | da                                                                | da                                                       | da                                 |
  |                                      | Vim                          | da                                                                | da                                                       | da                                 |
  | non-free editori                     | IntelliJ                     | [[https://cursive-ide.com/][Cursive]] (ima debugger), non-commercial license [[https://cursive-ide.com/non-commercial-licence.html][na 6 meseci]]        | [[https://github.com/go-lang-plugin-org/go-lang-idea-plugin][go-lang-idea-lugin]] (kažu da je OK)                       | [[https://github.com/rikvdkleij/intellij-haskell][intellij-haskell]] ([[https://plugins.jetbrains.com/plugin/7453][kažu da ima lag]]) |
  |                                      | Sublime                      | da (nema debugger), [[https://github.com/wuub/SublimeREPL/blob/master/doc/index.rst][SublimeREPL]]                                   | [[https://github.com/SublimeHaskell/SublimeHaskell][SublimeHaskell]]                                           | [[https://github.com/DisposaBoy/GoSublime][GoSublime]]                          |
  |--------------------------------------+------------------------------+-------------------------------------------------------------------+----------------------------------------------------------+------------------------------------|
  | community                            |                              | mlad, širok, entuzijastičan, inovativan                           | Hard core, mnogo znaju                                   | Google                             |
  |--------------------------------------+------------------------------+-------------------------------------------------------------------+----------------------------------------------------------+------------------------------------|
  | libs                                 |                              | stabilne, aktivan razvoj                                          | stabilne, sporiji razvoj                                 | stabilne, aktivan razvoj           |
  |--------------------------------------+------------------------------+-------------------------------------------------------------------+----------------------------------------------------------+------------------------------------|
  | interpreter                          |                              | Clojure REPL                                                      | GHCi                                                     | ništa standardno                   |
  |--------------------------------------+------------------------------+-------------------------------------------------------------------+----------------------------------------------------------+------------------------------------|
  | debugger                             |                              | integrisan (Emacs CIDER, IntelliJ, [[https://github.com/bpiel/sayid][sayid]])                         | ima u std lib                                            | [[https://github.com/derekparker/delve][delve]]                              |
  |--------------------------------------+------------------------------+-------------------------------------------------------------------+----------------------------------------------------------+------------------------------------|
  | profiler                             |                              | Java, [[https://github.com/ptaoussanis/tufte][tufte]], [[https://github.com/bpiel/sayid][sayid]]                                                | u okviru GHC (vrlo napredan)                             | [[https://golang.org/pkg/net/http/pprof/][pprof]], [[https://github.com/pkg/profile][profile]]                     |
  |--------------------------------------+------------------------------+-------------------------------------------------------------------+----------------------------------------------------------+------------------------------------|
  | runtime                              |                              | JVM                                                               | native                                                   | native                             |
  |--------------------------------------+------------------------------+-------------------------------------------------------------------+----------------------------------------------------------+------------------------------------|
  | static linking                       |                              |                                                                   | da (po default-u dynamic)                                | da                                 |
  |--------------------------------------+------------------------------+-------------------------------------------------------------------+----------------------------------------------------------+------------------------------------|
  | build tools                          |                              | [[https://github.com/technomancy/leiningen][Leiningen]] ([[https://clojars.org/][Clojars]]), [[https://github.com/boot-clj/boot][Boot]], Java                                   | [[https://github.com/commercialhaskell/stack][Stack]] ([[https://www.stackage.org/][Stackage]], odličan)                                | ima u std lib                      |
  |--------------------------------------+------------------------------+-------------------------------------------------------------------+----------------------------------------------------------+------------------------------------|
  | verbosity                            |                              | sažet                                                             | sažet                                                    | veoma brbljiv                      |
  |--------------------------------------+------------------------------+-------------------------------------------------------------------+----------------------------------------------------------+------------------------------------|
  | performanse (bez optimizacija)[fn:1] |                              | Clojure > Python > Ruby                                           | Haskell > Python (GHC - velike mogćnosti za opt., ~ C++) | Go ~ Haskell                       |
  |--------------------------------------+------------------------------+-------------------------------------------------------------------+----------------------------------------------------------+------------------------------------|
  | brzina učenja                        |                              | Clojure > Haskell                                                 | jedan od najzahtevnijih jezika                           | Go >> Python > Clojure             |
  |--------------------------------------+------------------------------+-------------------------------------------------------------------+----------------------------------------------------------+------------------------------------|
  | ostalo                               | to JS compiler               | [[https://github.com/clojure/clojurescript][ClojureScript]] (industrial level)                                  | [[http://elm-lang.org/][Elm]] i [[https://github.com/purescript/purescript][PureScript]] (industrial level), razni eksperimenti  | [[https://github.com/gopherjs/gopherjs][GopherJS]] (manje upotrebljiv)       |
  |                                      | konkurentno (nondeterminism) | [[https://en.wikipedia.org/wiki/Communicating_sequential_processes][CSP]]([[http://clojure.com/blog/2013/06/28/clojure-core-async-channels.html][core.async)]], [[http://clojure.org/reference/refs][STM]]                                              | [[https://hackage.haskell.org/package/base-4.9.0.0/docs/Control-Concurrent.html][Control.Concurrent]], [[https://hackage.haskell.org/package/stm][STM]], ...                             | [[https://en.wikipedia.org/wiki/Communicating_sequential_processes][CSP]] - ceo je oko toga              |

* Footnotes

[fn:1] Ocene koje uključuju performanse su uvek date sa rezervom.
