org/ntp.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="sr" xml:lang="sr">
<head>
<!-- 2017-02-06 пон 16:18 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Napredne tehnike programiranja</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Novak Boškov" />
<link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/bigblow/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/bigblow/css/bigblow.css"/>
<link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/bigblow/css/hideshow.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Napredne tehnike programiranja</h1>
<div id="table-of-contents">
<h2>Sadr&#382;aj</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgdbe6bdf">1. Pregled upotrebljivosti</a>
<ul>
<li><a href="#org38ffba3">1.1. Tabela upotrebljivosti</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgdbe6bdf" class="outline-2">
<h2 id="orgdbe6bdf"><span class="section-number-2">1</span> Pregled upotrebljivosti</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-org38ffba3" class="outline-3">
<h3 id="org38ffba3"><span class="section-number-3">1.1</span> Tabela upotrebljivosti</h3>
<div class="outline-text-3" id="text-1-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">Clojure</th>
<th scope="col" class="org-left">Haskell</th>
<th scope="col" class="org-left">Go</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">editori</td>
<td class="org-left">Atom</td>
<td class="org-left">da (nema debugger), <a href="https://atom.io/packages/proto-repl">proto-repl</a></td>
<td class="org-left"><a href="https://atom.io/packages/ide-haskell">ide-haskell</a> (<a href="https://github.com/simonmichael/haskell-atom-setup">setup manual</a>)</td>
<td class="org-left"><a href="https://atom.io/packages/go-plus">go-plus</a> (video sam da se koristi)</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left"><a href="https://github.com/LightTable/LightTable">LightTable</a></td>
<td class="org-left">pisan u Clojure (nema debugger)</td>
<td class="org-left"><a href="https://github.com/jetaggart/light-haskell">light-haskell</a> (slaba podrška)</td>
<td class="org-left"><a href="https://github.com/toqueteos/LightTable-Go">Light-Table-Go</a> (slaba podrška)</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left"><a href="https://github.com/oakes/Nightcode">NightCode</a></td>
<td class="org-left">pisan u Clojure, simple (nema debugger) - preporuka <a href="http://www.clojurebridge.org/">ClojureBridge</a></td>
<td class="org-left">ne</td>
<td class="org-left">ne</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left"><a href="http://leksah.org/">Leksah</a></td>
<td class="org-left">ne</td>
<td class="org-left">pisan u Haskell</td>
<td class="org-left">ne</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">Eclipse</td>
<td class="org-left"><a href="http://doc.ccw-ide.org/documentation.html#_debug_clojure_code">CCW</a> (ima integrisan debugger)</td>
<td class="org-left"><a href="http://eclipsefp.github.io/">Eclipse FP</a></td>
<td class="org-left"><a href="https://github.com/GoClipse/goclipse">GoClipse</a></td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">Visual Studio Code</td>
<td class="org-left"><a href="https://marketplace.visualstudio.com/items?itemName=avli.clojure">clojureVSCode</a> (nema debugger)</td>
<td class="org-left"><a href="https://marketplace.visualstudio.com/items?itemName=justusadam.language-haskell">Syntax HL</a> (<a href="https://visualstudio.uservoice.com/forums/293070-visual-studio-code/suggestions/7756542-haskell">slabo</a>)</td>
<td class="org-left"><a href="https://github.com/Microsoft/vscode-go">vscode-go</a></td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">Emacs</td>
<td class="org-left">da</td>
<td class="org-left">da</td>
<td class="org-left">da</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">Vim</td>
<td class="org-left">da</td>
<td class="org-left">da</td>
<td class="org-left">da</td>
</tr>

<tr>
<td class="org-left">non-free editori</td>
<td class="org-left">IntelliJ</td>
<td class="org-left"><a href="https://cursive-ide.com/">Cursive</a> (ima debugger), non-commercial license <a href="https://cursive-ide.com/non-commercial-licence.html">na 6 meseci</a></td>
<td class="org-left"><a href="https://github.com/go-lang-plugin-org/go-lang-idea-plugin">go-lang-idea-lugin</a> (kažu da je OK)</td>
<td class="org-left"><a href="https://github.com/rikvdkleij/intellij-haskell">intellij-haskell</a> (<a href="https://plugins.jetbrains.com/plugin/7453">kažu da ima lag</a>)</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">Sublime</td>
<td class="org-left">da (nema debugger), <a href="https://github.com/wuub/SublimeREPL/blob/master/doc/index.rst">SublimeREPL</a></td>
<td class="org-left"><a href="https://github.com/SublimeHaskell/SublimeHaskell">SublimeHaskell</a></td>
<td class="org-left"><a href="https://github.com/DisposaBoy/GoSublime">GoSublime</a></td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">community</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">mlad, širok, entuzijastičan, inovativan</td>
<td class="org-left">Hard core, mnogo znaju</td>
<td class="org-left">Google</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">libs</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">stabilne, aktivan razvoj</td>
<td class="org-left">stabilne, sporiji razvoj</td>
<td class="org-left">stabilne, aktivan razvoj</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">interpreter</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Clojure REPL</td>
<td class="org-left">GHCi</td>
<td class="org-left">ništa standardno</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">debugger</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">integrisan (Emacs CIDER, IntelliJ, <a href="https://github.com/bpiel/sayid">sayid</a>)</td>
<td class="org-left">ima u std lib</td>
<td class="org-left"><a href="https://github.com/derekparker/delve">delve</a></td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">profiler</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Java, <a href="https://github.com/ptaoussanis/tufte">tufte</a>, <a href="https://github.com/bpiel/sayid">sayid</a></td>
<td class="org-left">u okviru GHC (vrlo napredan)</td>
<td class="org-left"><a href="https://golang.org/pkg/net/http/pprof/">pprof</a>, <a href="https://github.com/pkg/profile">profile</a></td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">runtime</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">JVM</td>
<td class="org-left">native</td>
<td class="org-left">native</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">static linking</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">da (po default-u dynamic)</td>
<td class="org-left">da</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">build tools</td>
<td class="org-left">&#xa0;</td>
<td class="org-left"><a href="https://github.com/technomancy/leiningen">Leiningen</a> (<a href="https://clojars.org/">Clojars</a>), <a href="https://github.com/boot-clj/boot">Boot</a>, Java</td>
<td class="org-left"><a href="https://github.com/commercialhaskell/stack">Stack</a> (<a href="https://www.stackage.org/">Stackage</a>, odličan)</td>
<td class="org-left">ima u std lib</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">verbosity</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">sažet</td>
<td class="org-left">sažet</td>
<td class="org-left">veoma brbljiv</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">performanse (bez optimizacija)<sup><a id="fnr.1" class="footref" href="#fn.1">1</a></sup></td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Clojure &gt; Python &gt; Ruby</td>
<td class="org-left">Haskell &gt; Python (GHC - velike mogćnosti za opt., ~ C++)</td>
<td class="org-left">Go ~ Haskell</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">brzina učenja</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Clojure &gt; Haskell</td>
<td class="org-left">jedan od najzahtevnijih jezika</td>
<td class="org-left">Go &gt;&gt; Python &gt; Clojure</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">ostalo</td>
<td class="org-left">to JS compiler</td>
<td class="org-left"><a href="https://github.com/clojure/clojurescript">ClojureScript</a> (industrial level)</td>
<td class="org-left"><a href="http://elm-lang.org/">Elm</a> i <a href="https://github.com/purescript/purescript">PureScript</a> (industrial level), razni eksperimenti</td>
<td class="org-left"><a href="https://github.com/gopherjs/gopherjs">GopherJS</a> (manje upotrebljiv)</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">konkurentno (nondeterminism)</td>
<td class="org-left"><a href="https://en.wikipedia.org/wiki/Communicating_sequential_processes">CSP</a>(<a href="http://clojure.com/blog/2013/06/28/clojure-core-async-channels.html">core.async)</a>, <a href="http://clojure.org/reference/refs">STM</a></td>
<td class="org-left"><a href="https://hackage.haskell.org/package/base-4.9.0.0/docs/Control-Concurrent.html">Control.Concurrent</a>, <a href="https://hackage.haskell.org/package/stm">STM</a>, &#x2026;</td>
<td class="org-left"><a href="https://en.wikipedia.org/wiki/Communicating_sequential_processes">CSP</a> - ceo je oko toga</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1">1</a></sup> <div class="footpara"><p class="footpara">
Ocene koje uključuju performanse su uvek date sa rezervom.
</p></div></div>


</div>
</div></div>
<div id="postamble" class="status">
<p class="author">Author: Novak Boškov</p>
<p class="date">Created: 2017-02-06 пон 16:18</p>
<p class="validation"></p>
</div>
</body>
</html>
